---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.KingNeverInOptionWarn
source: html/d7fc505b-3d28-ee7a-c5de-0146321a94b6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.KingNeverInOptionWarn Property

A selected "[Serf]" belongs to a "[King]" which cannot be added to an Option--it was not added to the Option Set.

## Syntax (C#)
```csharp
public static FailureDefinitionId KingNeverInOptionWarn { get; }
```